xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/RegisterMap.c
/*****************************************************************************
*
* SUREFLAP CONFIDENTIALITY & COPYRIGHT NOTICE
*
* Copyright © 2013-2021 Sureflap Limited.
* All Rights Reserved.
*
* All information contained herein is, and remains the property of Sureflap
* Limited.
* The intellectual and technical concepts contained herein are proprietary to
* Sureflap Limited. and may be covered by U.S. / EU and other Patents, patents
* in process, and are protected by copyright law.
* Dissemination of this information or reproduction of this material is
* strictly forbidden unless prior written permission is obtained from Sureflap
* Limited.
*
* Filename: RegisterMap.c
* Author:   Chris Cowdery 14/10/2019
* Purpose:  Handles the Hub Register Map.
*
*
*
**************************************************************************/

#include "hermes.h"

/* Standard includes. */
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "queue.h"
#include "event_groups.h"
/* Other includes */
#include "hermes-app.h"
#include "hermes-time.h"
#include "devices.h"    // for DEVICE_TYPE_HUB and DEVICE_STATUS
#include "SureNet-Interface.h"
#include "RegisterMap.h"
#include "buildnumber.h"
#include "Server_Buffer.h"
#include "message_parser.h"
#include "fsl_debug_console.h"
#include "leds.h"
#include "BankManager.h"
#include "utilities.h"
#include "wolfssl/wolfcrypt/sha256.h"

// Global variables
uint8_t						hub_debug_mode;
extern QueueHandle_t		xSendDeviceStatusMailbox;
extern QueueHandle_t		xSendDeviceTableMailbox;
extern EventGroupHandle_t	xSurenet_EventGroup;
extern QueueHandle_t		xLedMailbox;

// Local #defines
#define INITIAL_NUMBER_OF_EXPOSED_DEVICES	60	// this is how many entries of the DEVICE_TABLE
												// are exposed to the server on reset.
// Local variables
uint8_t number_of_exposed_devices;

// Local Functions
static void HubReg_Handle_Device_Status(void);
static void Hub_Registers_Send_Range(uint32_t start_index, uint32_t count);

uint8_t	reg_read(uint16_t address);
void	null_write_fn(uint16_t address,uint8_t uint8_t);
uint8_t	null_read_fn(uint16_t address);
uint8_t	checksum_read(uint16_t address);
void	pairing_handler_write(uint16_t address,uint8_t value);
uint8_t	pairing_handler_read(uint16_t address);
uint8_t	get_debug_mode(uint16_t address);
void	led_mode_write(uint16_t address,uint8_t value);
void	remote_reboot(uint16_t address,uint8_t value);
void	clear_pairing_table(uint16_t address,uint8_t value);
void	delete_pairing_table_entry(uint16_t address,uint8_t value);
uint8_t	radio_channel_noise_floor(uint16_t address);
uint8_t	get_surenet_channel_number(uint16_t address);
void	set_surenet_channel_number(uint16_t address,uint8_t value);
uint8_t	app_error_read(uint16_t address);
uint8_t	hub_uptime_read(uint16_t address);
uint8_t	bank_desc_read(uint16_t address);
uint8_t	get_num_pairs(uint16_t address);
uint8_t	getHwVersion(uint16_t address);
void	initiate_channel_hop(uint16_t address,uint8_t value);
void	clearHubBank(void);
uint8_t	led_mode_read(uint16_t address);
void	change_device_table_size(uint16_t address,uint8_t value);
uint8_t	trigger_get_device_table(uint16_t address);
void	get_device_table(bool trigger);
void	update_register_map_device_table_size(uint8_t value);
uint8_t	HRM_Read_Image_Hash(uint16_t address);

// Register Name						Read Handler					Write Handler 				Value						Update Flag		End of Block	Hashed}
T_HUB_REGISTER_ENTRY hubRegisterBank[HR_LAST_ELEMENT] @ "ITCM" = {
  [HR_DEVICE_TYPE] 						= {	reg_read,					null_write_fn,				DEVICE_TYPE_HUB,			false,			false,			true},	// 0
  [HR_NUM_REGISTERS_LOW]				= {	reg_read,					null_write_fn,				0,							false,			false,			true},
  [HR_NUM_REGISTERS_HIGH]				= {	reg_read,					null_write_fn,				0,							false,			false,			true},
  [HR_HUB_FIRMWARE_MAJOR_LOW]			= {	reg_read,					null_write_fn,				(SVN_REVISION & 0xff),		false,			false,			true},
  [HR_HUB_FIRMWARE_MAJOR_HIGH]			= {	reg_read,					null_write_fn,				((SVN_REVISION>>8) & 0xff),	false,			false,			true},
  [HR_HUB_FIRMWARE_MINOR_LOW]			= {	reg_read,					null_write_fn,				(BUILD_MARK & 0xff),		false,			false,			true},
  [HR_HUB_FIRMWARE_MINOR_HIGH]			= {	reg_read,					null_write_fn,				((BUILD_MARK>>8) & 0xff),	false,			false,			true},
  [HR_HUB_HARDWARE_MAJOR_LOW]			= {	getHwVersion,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_HARDWARE_MAJOR_HIGH]			= {	reg_read,					null_write_fn,				(HUB_HARDWARE_REVISION_MAJOR & 0xff),	false,	false,		true},
  [HR_HUB_BOOTLOADER_MAJOR]				= {	reg_read,					null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BOOTLOADER_MINOR]				= {	reg_read,					null_write_fn,				0,							false,			false,			true},	// 10
  [HR_HUB_MAX_MESSAGE_SIZE_LOW] 		= {	null_read_fn,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_MAX_MESSAGE_SIZE_HIGH]		= {	null_read_fn,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_FIRMWARE_CHECKSUM_LOW]		= {	checksum_read,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_FIRMWARE_CHECKSUM_HIGH] 		= {	checksum_read,				null_write_fn,				0,							false,			true,			true},	// 14
  [HR_PAIRING_STATE] 					= {	pairing_handler_read,		pairing_handler_write,		0,							false,			false,			false},
  [HR_DEBUG_MODE]						= {	get_debug_mode,				HubReg_SetDebugMode,		0,							false,			false,			false},
  [HR_PAIRING_TIMER_VALUE]				= {	null_read_fn,				null_write_fn,				0,							false,			false,			false},
  [HR_LEDS_MODE]						= {	reg_read,					led_mode_write,				9,							false,			false,			false},
  [HR_REMOTE_REBOOT]					= {	null_read_fn,				remote_reboot,				0,							false,			false,			false},
  [HR_CLEAR_PAIRING_TABLE]				= {	null_read_fn,				clear_pairing_table,		0,							false,			false,			false},	// 20
  [HR_INITIATE_CHANNEL_HOP]				= {	null_read_fn,				initiate_channel_hop,		0,							false,			false,			false},
  [HR_DELETE_CONNECTION_TABLE_ENTRY]	= {	null_read_fn,				delete_pairing_table_entry,	0,							false,			false,			false},
  [HR_SURENET_CHANNEL_NOISE_FLOOR]		= {	radio_channel_noise_floor,	null_write_fn,				0,							false,			false,			false},
  [HR_SURENET_CHANNEL_NUMBER]			= {	get_surenet_channel_number,	set_surenet_channel_number,	0,							false,			false,			false},
  [HR_APPLICATION_ERROR_LOW]			= {	app_error_read,				null_write_fn,				0,							false,			false,			true},
  [HR_APPLICATION_ERROR_HIGH]			= {	app_error_read,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_UPTIME_LOW]					= {	hub_uptime_read,			null_write_fn,				1,							false,			false,			false},
  [HR_HUB_UPTIME_BITS_15_8]				= {	hub_uptime_read,			null_write_fn,				2,							false,			false,			false},
  [HR_HUB_UPTIME_BITS_23_16]			= {	hub_uptime_read,			null_write_fn,				3,							false,			false,			false},
  [HR_HUB_UPTIME_HIGH]					= {	hub_uptime_read,			null_write_fn,				4,							false,			false,			false},	// 30
  [HR_HUB_BANK_A_MARK]					= {	bank_desc_read,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_A_WDOG_RESETS]			= {	bank_desc_read,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_B_MARK]					= {	bank_desc_read,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_B_WDOG_RESETS]			= {	bank_desc_read,				null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_A_HASH_LOW]				= {	HRM_Read_Image_Hash,		null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_A_HASH_BITS_15_8]		= {	HRM_Read_Image_Hash,		null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_A_HASH_BITS_23_16]		= {	HRM_Read_Image_Hash,		null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_A_HASH_HIGH]				= {	HRM_Read_Image_Hash,		null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_B_HASH_LOW]				= {	HRM_Read_Image_Hash,		null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_B_HASH_BITS_15_8]		= {	HRM_Read_Image_Hash,		null_write_fn,				0,							false,			false,			true},	// 40
  [HR_HUB_BANK_B_HASH_BITS_23_16]		= {	HRM_Read_Image_Hash,		null_write_fn,				0,							false,			false,			true},
  [HR_HUB_BANK_B_HASH_HIGH]				= {	HRM_Read_Image_Hash,		null_write_fn,				0,							false,			false,			true},
  [HR_DEVICE_TABLE_SIZE]				= {	reg_read,					change_device_table_size,	0,							false,			false,			true},
  [HR_DEVICE_TABLE_NUMBER_CONNECTIONS]	= {	get_num_pairs,				null_write_fn,				0,							false,			true,			true},
// we'll stuff the connection table entries programatically in clearHubBank()
};

// We use this enum to understand pairing mode requests from the Server
typedef enum
{
	PAIRING_OFF,		// used to be PAIRING_NEAR_FIELD and is used to indicate turning off pairing mode
	PAIRING_DISTANCE,	// NOT USED
	PAIRING_MANUAL_SERVER_INITIATED = 0x02,	// Server has sent down command to put unit into pairing mode
	PAIRING_MANUAL_HUB_INITIATED = 0x82,	// User has pushed button on the bottom of the Hub
} HUB_PAIRING_MODE;

/**************************************************************
 * Function Name   : trigger_get_device_table
 * Description     : Gets an up to date copy of the Device Table.
 *				   : Triggered by a read of the first entry in the Device Table
 **************************************************************/
uint8_t trigger_get_device_table(uint16_t address)
{
	get_device_table(true);	// update register map
	return hubRegisterBank[address].value;
}

