xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/RegisterMap.c
void HubReg_Handle_Messages(void)
{
	if( uxQueueMessagesWaiting(xSendDeviceTableMailbox) > 0 )
	{	// Device Table waiting for us. Handle without requesting again.
		get_device_table(false);
	}

	if( uxQueueMessagesWaiting(xSendDeviceStatusMailbox) > 0 )
	{
		HubReg_Handle_Device_Status();
	}
}

/**************************************************************
 * Function Name   : get_device_table
 * Description     : Send a message to SureNet to get the Device Table
 **************************************************************/
void get_device_table(bool trigger)
{
	bool dummy = true;
	uint32_t i;
	uint8_t dev_table[sizeof(DEVICE_STATUS) * MAX_NUMBER_OF_DEVICES];

	xQueueReceive(xSendDeviceTableMailbox, &dev_table, 0); // ensure mailbox is empty

	// send a message to SureNet to get a message back with the Device Table in it
	if( true == trigger ){ xEventGroupSetBits(xSurenet_EventGroup, SURENET_GET_DEVICE_TABLE); }

	// Give it plenty of time as SureNet may be busy (e.g. after power-up with a large fleet of Devices)
    if( pdPASS == xQueueReceive(xSendDeviceTableMailbox, &dev_table, pdMS_TO_TICKS(10000)) )
	{	// a copy of the DEVICE_TABLE is now in dev_table, so we copy it into the register map
		for (i = 0; i < (sizeof(DEVICE_STATUS)*MAX_NUMBER_OF_DEVICES); i++)
		{
			hubRegisterBank[i + HR_DEVICE_TABLE].value = dev_table[i];
		}
	} else
	{ // This might happen if SureNet is too busy to deal with the request above.
		zprintf(MEDIUM_IMPORTANCE, "Device Table Read Failed.\r\n");
	}
}

/**************************************************************
 * Function Name   : HubReg_Handle_Device_Status
 * Description     : Checks to see if a line in device_status differs
 *                 : from it's corresponding line in hubRegisterBank.
 *                 : If so, copy the entire line across
 *                 : If request.limited == false, update every updateWebFlag
 *                 : If request.limited == true, only update the
 *                 : updateWebFlags for the first DEVICE_STATUS_LAST_HEARD_POS
 *                 : bytes which excludes .last_heard_from
 **************************************************************/
static void HubReg_Handle_Device_Status(void)
{
	DEVICE_STATUS_REQUEST	request;
	bool require_update = false;
	if( pdPASS == xQueueReceive(xSendDeviceStatusMailbox, &request, 0) )
	{
		uint8_t* ptr = (uint8_t*)&request.device_status;
		int i, j = HR_DEVICE_TABLE + request.line * sizeof(DEVICE_STATUS);

		for( i = 0; i < sizeof(DEVICE_STATUS); i++ )
		{
			if( hubRegisterBank[j+i].value != ptr[i] )
			{
				require_update = true;	// the two lines differ.
			}
		}

		if (true == require_update)	// the lines differ so update hubRegisterBank
		{
			for( i = 0; i < sizeof(DEVICE_STATUS); i++)
			{
				hubRegisterBank[j+i].value = ptr[i];
				if( (false == request.limited) || (i < DEVICE_STATUS_LAST_HEARD_POS) )
				{
					hubRegisterBank[j+i].updateWebFlag = true; // In limited mode, only update the non-time parts.
				}
			}
		}
		get_num_pairs(HR_DEVICE_TABLE_NUMBER_CONNECTIONS);  //ensure register 44 is properly initialised
		hubRegisterBank[HR_DEVICE_TABLE_NUMBER_CONNECTIONS].updateWebFlag = true; // need to tell the server about this
	} else
	{
		zprintf(MEDIUM_IMPORTANCE, "HubReg_Handle_Device_Status() failed to read mailbox\r\n");
	}
}

/**************************************************************
 * Function Name   : change_device_table_size
 * Description     : Called when the server wants to change the amount of the device
 *                 : table exposed via the register map.
 **************************************************************/
void change_device_table_size(uint16_t address,uint8_t value)
{
	update_register_map_device_table_size(value);
}

/**************************************************************
 * Function Name   : update_register_map_device_table_size
 * Description     : Handle changes to the register map as a result
 *                 : of changing the number of device table entries exposed to the server
 **************************************************************/
void update_register_map_device_table_size(uint8_t number_of_devices)
{
	uint8_t old_number_of_devices;
	uint32_t i;
	uint16_t old_num_registers, num_registers;

	if (number_of_devices>MAX_NUMBER_OF_DEVICES)
		return;	// just bail out if request is larger than the maximum size
	// First update the registers that depend on the number of devices we are exposing
	old_number_of_devices = hubRegisterBank[HR_DEVICE_TABLE_SIZE].value;
	num_registers = HR_DEVICE_TABLE+(sizeof(DEVICE_STATUS)*number_of_devices);
	old_num_registers = (hubRegisterBank[HR_NUM_REGISTERS_HIGH].value<<8) + hubRegisterBank[HR_NUM_REGISTERS_LOW].value;

	hubRegisterBank[HR_DEVICE_TABLE_SIZE].value = number_of_devices;
	hubRegisterBank[HR_NUM_REGISTERS_LOW].value = (num_registers & 0xff);
	hubRegisterBank[HR_NUM_REGISTERS_HIGH].value = ((num_registers >> 8)&0xff);

	hubRegisterBank[HR_DEVICE_TABLE_SIZE].updateWebFlag = true;
	hubRegisterBank[HR_NUM_REGISTERS_LOW].updateWebFlag = true;
	hubRegisterBank[HR_NUM_REGISTERS_HIGH].updateWebFlag = true;

	// Bearing in mind that the data already exists in the register map, we just need
	// to set the Update flags for the newly exposed data.
	if (number_of_devices>old_number_of_devices)
	{	// set the update flags for the newly exposed part of the register map
		for (i=(old_num_registers+1); i<num_registers; i++)
		{
			hubRegisterBank[i].updateWebFlag = false;
		}
	}
}

/**************************************************************
 * Function Name   : HubReg_Init
 * Description     : Initialise our register map
 **************************************************************/
void HubReg_Init(void)
{
	LED_MODE 	led_brightness;
	LED_DISPLAY	led_display;
	led_brightness = get_led_brightness(); // read value from NVM

	switch(led_brightness)	// translate from internal to external representation
	{
		case LED_MODE_OFF:
			led_display = LED_DISPLAY_OFF;
			break;
		case LED_MODE_DIM:
			led_display = LED_DISPLAY_DIM;
			break;
		case LED_MODE_NORMAL:
			led_display = LED_DISPLAY_NORMAL;
			break;
		default:
			zprintf(LOW_IMPORTANCE,"LED brightness from NVM has invalid value %d\r\n",led_brightness);
			led_display = LED_DISPLAY_NORMAL;
			break;
	}
	hubRegisterBank[HR_LEDS_MODE].value = led_display;

