xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/RegisterMap.c
	// set HR_DEVICE_TABLE_SIZE and HUB_NUM_REGISTERS, and their updateWebFlags.
	// Also set updateWebFlags on the registers in the Device Table.
	update_register_map_device_table_size(INITIAL_NUMBER_OF_EXPOSED_DEVICES);

	// populate the device table structure entires with function pointers for read/write, updateWebFlag
	// etc, but not the actual register values
    clearHubBank();

	// This gets the actual device table values via a mailbox from SureNet
	get_device_table(true);
}

/**************************************************************
 * Function Name   : HubReg_Check_Full
 * Description     : Scan through the Hub registers, if any have updateWebFlag set to true
 *                 : then form a MSG_SET_REG_RANGE message and send it all to the outgoing message cache.
 *                 : Note that these messages are not prefixed with a subtopic (messages
 *                 : from the Devices are prefixed with their MAC address)
 **************************************************************/
void HubReg_Check_Full(void)
{
	uint32_t		i, j, base_index, next_entry;
	bool			sending = false;

	// Work out if we need to transmit anything from the general map.
	for( i = 0; i < HR_DEVICE_TABLE; i++ )
	{
		if( false != hubRegisterBank[i].updateWebFlag )
		{
			sending = true;
		}
	}

	if( true == sending )
	{
		Hub_Registers_Send_Range(0, HR_DEVICE_TABLE);
	}

	sending = false;

	// Now check the pair table, in large blocks.
	for( j = 0; j < MAX_NUMBER_OF_DEVICES; j++ )
	{
		sending = false;
		base_index = HR_DEVICE_TABLE + j * sizeof(DEVICE_STATUS);
		for( i = 0; i < sizeof(DEVICE_STATUS); i++ )
		{
			if( false != hubRegisterBank[base_index + i].updateWebFlag )
			{
				sending = true;
			}
		}

		if( true == sending )
		{
			next_entry = (j / MAX_PAIR_ENTRIES_PER_MESSAGE) * MAX_PAIR_ENTRIES_PER_MESSAGE;
			base_index = HR_DEVICE_TABLE + sizeof(DEVICE_STATUS) * next_entry;
			Hub_Registers_Send_Range(base_index, sizeof(DEVICE_STATUS) * MAX_PAIR_ENTRIES_PER_MESSAGE);
			j = next_entry + MAX_PAIR_ENTRIES_PER_MESSAGE;
		}
	}
}

static void Hub_Registers_Send_Range(uint32_t start_index, uint32_t count)
{
	static uint8_t 	server_set_reg_count	= 0;	// Will wrap around. Server has limit of 8 bit value

	uint8_t			outgoing_message[MAX_MESSAGE_SIZE_SERVER_BUFFER];
	SERVER_MESSAGE	server_message = {outgoing_message, 0};
	uint32_t		pos, i;

	if( start_index + count >= HR_GET_DYNAMIC_SIZE() )
	{
		count = HR_GET_DYNAMIC_SIZE() - start_index;
	}

	if( count == 0 ){ return; }

	pos = snprintf((char*)outgoing_message, sizeof(outgoing_message), "%d %d %d %d", MSG_REG_VALUES_INDEX_ADDED, server_set_reg_count, start_index, count);
	server_set_reg_count++;

	for( i = 0; i < count; i++ )
	{
		pos += snprintf((char*)&outgoing_message[pos], sizeof(outgoing_message) - pos, " %02x", hubRegisterBank[start_index + i].value);
	}

	if( true == server_buffer_add(&server_message) )
	{
		for( i = 0; i < count; i++ )
		{
			hubRegisterBank[start_index + i].updateWebFlag = false;
		}
	}
}

void HubReg_Send_All(void)
{
	uint32_t i;
	for( i = 0; i < HR_LAST_ELEMENT; i++ )
	{
		hubRegisterBank[i].updateWebFlag = true;
	}
}

/**************************************************************
 * Function Name   : reg_read
 * Description     : returns the value of a hub register
 **************************************************************/
uint8_t reg_read(uint16_t address)
{
	return hubRegisterBank[address].value;
}

uint8_t getHwVersion(uint16_t address)
{
	return readHwVersion();
}

/**************************************************************
 * Function Name   : reg_write
 * Description     : Updates a hub register. Also takes appropriate action. Used for old style registers.
 **************************************************************/
void reg_write(uint16_t address,uint8_t value)
{
	if (address>HR_LAST_ELEMENT) return;  // just ignore writes to bum addresses
	regmap_printf("reg_write() - address %d = %d\r\n",address,value);
	hubRegisterBank[address].value = value;
	hubRegisterBank[address].updateWebFlag = true;
}

/**************************************************************
 * Function Name   : null_write_fn
 * Description     : Function that does nothing, called when a read only register is written
 **************************************************************/
void null_write_fn(uint16_t address,uint8_t uint8_t)
{
    // do nothing
}

/**************************************************************
 * Function Name   : null_read_fn
 * Description     : Function that does nothing, called when a write only register is read
 **************************************************************/
uint8_t null_read_fn(uint16_t address)
{
    return 0;
}

/**************************************************************
 * Function Name   : checksum_read
 * Description     : Calculates the checksum crc16 of active flash bank
 **************************************************************/
extern uint32_t		m_bank_a_start;
extern uint32_t		m_bank_a_size;
uint8_t checksum_read(uint16_t address)
{
  	uint32_t 			i;
	static uint16_t 	crc=0;

	if( HR_HUB_FIRMWARE_CHECKSUM_LOW == address)
  {
		crc = CRC16((uint8_t *)&m_bank_a_start, (uint32_t)&m_bank_a_size, 0xcccc);
  }

	if( address == HR_HUB_FIRMWARE_CHECKSUM_LOW ) return crc & 0xFF;
	return (crc >> 8) & 0xFF;
}

/**************************************************************
 * Function Name   : pairing_handler_write
 * Description     : Handle writes to pairing registers.
 *                 : Note that if Pairing Mode is entered 'locally', i.e.
 *                 : by a button push, then the value in this register is 0x82
 *                 : which is 'immediately' bounced back down by the server
 *                 : as 0x02.
 **************************************************************/
void pairing_handler_write(uint16_t address,uint8_t value)
{
	PAIRING_REQUEST request = {0,false,PAIRING_REQUEST_SOURCE_SERVER};
	PAIRING_REQUEST current_pairing_mode;

	if( value == PAIRING_MANUAL_SERVER_INITIATED)
		zprintf(LOW_IMPORTANCE,"pairing_handler_write(PAIRING_MANUAL_SERVER_INITIATED)\r\n");
	else	// should be 0 for off
		zprintf(LOW_IMPORTANCE,"pairing_handler_write(%d)\r\n",value);

    hubRegisterBank[address].value = value;   // somewhat pointless as we read from SureNet rather than this register

	current_pairing_mode = surenet_get_hub_pairing_mode();

