xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/RegisterMap.c
	if( value == PAIRING_MANUAL_SERVER_INITIATED) request.enable = true;	// should be 0x02
	{
		if( false == request.enable)
		{	// we always honour the server disabling pairing mode
			zprintf(LOW_IMPORTANCE,"Changing pairing mode to disabled\r\n");
			surenet_set_hub_pairing_mode(request);
		}
		else
		{	// request.enable == true
			if( false == current_pairing_mode.enable)
			{	// only honour server requests to go into pairing mode if we are not already in pairing mode
				zprintf(LOW_IMPORTANCE,"Changing pairing mode to enabled\r\n");
				surenet_set_hub_pairing_mode(request);
			}
			// else drop the request
		}
	}
}

/**************************************************************
 * Function Name   : pairing_handler_read
 * Description     : Handle reads from pairing registers
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
uint8_t pairing_handler_read(uint16_t address)
{
	// This register should always be up to date as the callback from the stack when pairing mode
	// changes always ends up in HubReg_SetPairingMode()
    return hubRegisterBank[address].value;
}

/**************************************************************
 * Function Name   : set_pairing_mode_register
 * Description     : Sets the pairing mode register in the hub register bank
 **************************************************************/
void HubReg_SetPairingMode(PAIRING_REQUEST request)
{
	uint8_t value = PAIRING_OFF;
	if( true == request.enable )
	{
		if( PAIRING_REQUEST_SOURCE_SERVER == request.source )
			value = PAIRING_MANUAL_SERVER_INITIATED;	// This value does NOT elicit a server response.
		else
			value = PAIRING_MANUAL_HUB_INITIATED;	// Note the server will respond by writing PAIRING_MANUAL_SERVER_INITIATED
	}												// to the pairing mode register.

    hubRegisterBank[HR_PAIRING_STATE].value = value;
	hubRegisterBank[HR_PAIRING_STATE].updateWebFlag = true;

}

/**************************************************************
 * Function Name   : get_debug_mode
 * Description     : Gets a global 'debug mode' variable
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
uint8_t get_debug_mode(uint16_t address)
{
  hubRegisterBank[address].value = hub_debug_mode;
  return hubRegisterBank[address].value;
}

/**************************************************************
 * Function Name   : HubReg_SetDebugMode
 * Description     : Sets a global 'debug mode' variable
 **************************************************************/
void HubReg_SetDebugMode(uint16_t address, uint8_t value)
{
	hub_debug_mode = value;
	hubRegisterBank[address].value = value;
}

/**************************************************************
 * Function Name   : led_mode_write(uint16_t address,INT8 value)
 * Description     :
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void led_mode_write(uint16_t address, uint8_t value)
{
	// Check if bit 7 is set, if so, send an event to trigger a 'success' LED flash
	if ((value & LED_MODE_SUCCESS_BIT) != 0)
	{
		process_system_event(STATUS_DISPLAY_SUCCESS);
	}
	zprintf(LOW_IMPORTANCE,"Server setting brightness to %d\r\n",value);
	switch (value & LED_MODE_DISPLAY_MASK)
	{
		case LED_DISPLAY_OFF:
			set_led_brightness(LED_MODE_OFF, true);
			break;
		case LED_DISPLAY_DIM:
			set_led_brightness(LED_MODE_DIM, true);
			break;
		case LED_DISPLAY_NORMAL:
			set_led_brightness(LED_MODE_NORMAL, true);
			break;
		default:
			zprintf(LOW_IMPORTANCE,"Server sent invalid LED brightness - 0x%02X. Defaulting to NORMAL\r\n",value);
			set_led_brightness(LED_MODE_NORMAL, true);
			break;
	}

    hubRegisterBank[address].value = value;
    hubRegisterBank[address].updateWebFlag = true;    // suspect this is a debug feature
}

/**************************************************************
 * Function Name   : remote_reboot
 * Description     : Reset the hub cpu if 0xdd written to it.
 **************************************************************/
extern PRODUCT_CONFIGURATION product_configuration;
void remote_reboot(uint16_t address, uint8_t value)
{
	switch( value )
	{
		case RESET_PROCESSOR:
			NVIC_SystemReset(); // never returns
			break;
		case RESET_PROCESSOR_AND_USE_8_BYTE_RF_MAC:
			product_configuration.rf_mac_mangle = false;
			write_product_configuration();
			NVIC_SystemReset(); // never returns
			break;
		case RESET_PROCESSOR_AND_USE_6_BYTE_RF_MAC:
			product_configuration.rf_mac_mangle = true;
			write_product_configuration();
			NVIC_SystemReset(); // never returns
			break;
	}
}

/**************************************************************
 * Function Name   : clear_pairing_table
 **************************************************************/
void clear_pairing_table(uint16_t address,uint8_t value)  // only value 0xff will cause table to be cleared
{
	regmap_printf("Called clear_pairing_table value=%x\r\n", value);
	if (value==0xff)  // for safety only allow one specific value to trigger clearing
	{
		surenet_hub_clear_pairing_table();
	} else
	{
		regmap_printf("Invalid value (require 255)\r\n");
	}
}

/**************************************************************
 * Function Name   : clear_pairing_table
 **************************************************************/
void delete_pairing_table_entry(uint16_t address, uint8_t value)  //value is index to be cleared
{
	regmap_printf("Called delete_pairing_table entry %x\r\n", value);
	zprintf(LOW_IMPORTANCE,"delete_pairing_table entry(%x)\r\n", value);
	if( value < MAX_NUMBER_OF_DEVICES ){ surenet_unpair_device_by_index(value); }
}


/**************************************************************
 * Function Name   : radio_channel_noise_floor
 * Description     : Read the noise floor of the radio receiver (currently unimplemented)
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
uint8_t radio_channel_noise_floor(uint16_t address)
{
    return hubRegisterBank[address].value;
}

/**************************************************************
 * Function Name   :surenet_channel_number
 * Description     :
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
uint8_t get_surenet_channel_number(uint16_t address)
{
    hubRegisterBank[address].value = surenet_get_channel();
    return hubRegisterBank[address].value;
}

/**************************************************************
 * Function Name   : set_surenet_channel_number
 * Description     :
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void set_surenet_channel_number(uint16_t address,uint8_t channel)
{
	regmap_printf("In set_surenet_channel_number %d\r\n", channel);
	zprintf(LOW_IMPORTANCE,"RF Channel changed to %d\r\n",channel);
	channel = surenet_set_channel(channel);
	hubRegisterBank[address].value = channel; // Ought to call surenet_get_channel() but that uses mailboxes and may not be up to date.
    hubRegisterBank[address].updateWebFlag = true;
}

/**************************************************************
 * Function Name   : app_error_read
 * Description     : Unsupported mechanism for reporting application errors
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
uint8_t app_error_read(uint16_t address)
{
    return 0;   // we don't have application errors
}

/**************************************************************
 * Function Name   : hub_uptime_read
 * Description     : Returns time in seconds since hub was last reset
 *                 : Note that the first read should be HR_HUB_UPTIME_LOW to trigger an atomic read of the timer
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
uint8_t hub_uptime_read(uint16_t address)
{
	uint32_t t;
	t = get_UpTime();  // get local copy of time so if interrupt changes it partway through, it doesn't matter
	if( address == HR_HUB_UPTIME_LOW )
	{
		hubRegisterBank[HR_HUB_UPTIME_LOW].value = t & 0xff;
		hubRegisterBank[HR_HUB_UPTIME_BITS_15_8].value = (t>>8) & 0xff;
		hubRegisterBank[HR_HUB_UPTIME_BITS_23_16].value = (t>>16) & 0xff;
		hubRegisterBank[HR_HUB_UPTIME_HIGH].value = (t>>24) & 0xff;

		hubRegisterBank[HR_HUB_UPTIME_LOW].updateWebFlag = true;
		hubRegisterBank[HR_HUB_UPTIME_BITS_15_8].updateWebFlag = true;
		hubRegisterBank[HR_HUB_UPTIME_BITS_23_16].updateWebFlag = true;
		hubRegisterBank[HR_HUB_UPTIME_HIGH].updateWebFlag = true;
	}

	return hubRegisterBank[address].value;
}

/**************************************************************
 * Function Name   : bank_desc_read
 * Description     : Returns various elements of the Bank Descriptors
 *                 : Note that the source data are uint32_t, so we only
 *                 : output a truncated form.
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
extern const BANK_DESCRIPTOR	BankA_Descriptor;
extern const BANK_DESCRIPTOR	BankB_Descriptor;
uint8_t bank_desc_read(uint16_t address)
{
	uint8_t retval = 0;

	switch( address )
	{
		case HR_HUB_BANK_A_MARK:
			retval = (uint8_t)BankA_Descriptor.bank_mark;
			break;
		case HR_HUB_BANK_A_WDOG_RESETS:
			retval = (uint8_t)BankA_Descriptor.watchdog_resets;
			break;
		case HR_HUB_BANK_B_MARK:
			retval = (uint8_t)BankB_Descriptor.bank_mark;
			break;
		case HR_HUB_BANK_B_WDOG_RESETS:
			retval = (uint8_t)BankB_Descriptor.watchdog_resets;
			break;
	}
	hubRegisterBank[address].value = retval;
	hubRegisterBank[address].updateWebFlag = true;

	return retval;
}

/**************************************************************
 * Function Name   : get_num_pairs
 * Description     : Find out how many Devices are paired with us.
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
uint8_t get_num_pairs(uint16_t address)
{
	hubRegisterBank[address].value = surenet_how_many_pairs();
	return hubRegisterBank[address].value;
}

/**************************************************************
 * Function Name   : initiate_channel_hop
 * Description     :
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void initiate_channel_hop(uint16_t address,uint8_t value)
{
	surenet_trigger_channel_hop();
}

/**************************************************************
 * Function Name   : clearHubBank
 * Description     : Sets up the part of the Hub bank that isn't initialised at boot time
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void clearHubBank(void)
{
    int i,j;
    for (i=0; i<MAX_NUMBER_OF_DEVICES; i++)
    {
        for (j=0; j<sizeof(DEVICE_STATUS); j++)
        {
            hubRegisterBank[(i*sizeof(DEVICE_STATUS))+j+HR_DEVICE_TABLE].read_handler_function = reg_read;
            hubRegisterBank[(i*sizeof(DEVICE_STATUS))+j+HR_DEVICE_TABLE].write_handler_function = null_write_fn;
            //hubRegisterBank[(i*sizeof(DEVICE_STATUS))+j+HR_DEVICE_TABLE].updateWebFlag = true;
            hubRegisterBank[(i*sizeof(DEVICE_STATUS))+j+HR_DEVICE_TABLE].value = 0;
            hubRegisterBank[(i*sizeof(DEVICE_STATUS))+j+HR_DEVICE_TABLE].end_of_block = false;
        }
        // now set the final entry for an DEVICE_STATUS to be the end of that block
        hubRegisterBank[((i+1)*sizeof(DEVICE_STATUS))-1+HR_DEVICE_TABLE].end_of_block = true;
    }
	// special case for reading the first entry - it gets an uptodate copy atomically from SureNet
	hubRegisterBank[HR_DEVICE_TABLE].read_handler_function = trigger_get_device_table;
}

/**************************************************************
 * Function Name   : HubReg_SetValues
 * Description     : Updates Hub registers with values received from the server
 **************************************************************/
void HubReg_SetValues(uint16_t address,uint16_t numValues,uint8_t *values,bool set_update_flag)
{
	uint32_t i;
    if( (address >= HR_GET_DYNAMIC_SIZE()) || \
		((address + numValues - 1) >= HR_GET_DYNAMIC_SIZE()) )
	{
		return;
	}

	if( (address + numValues) > (HR_LAST_ELEMENT + 1) )
	{
		zprintf(CRITICAL_IMPORTANCE,"Server attempting to set out of range register %d %d\r\n",address,numValues);
		numValues = HR_LAST_ELEMENT + 1 - address;
	}

