xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/RegisterMap.c
	for( i = 0; i < numValues; i++)
	{
		if( set_update_flag == true )
		{
			hubRegisterBank[address+i].updateWebFlag = true;
		}
        if( hubRegisterBank[address+i].write_handler_function != NULL )
		{
			hubRegisterBank[address+i].write_handler_function(address+i, values[i]);
		}
	}
}

/**************************************************************
 * Function Name   : HubReg_GetValues
 * Description     : Refreshes Hub Register values and markes them to be transmitted to the server
 **************************************************************/
void HubReg_GetValues(uint16_t address, uint16_t numValues)
{
    uint32_t i;
    if( (address >= HR_GET_DYNAMIC_SIZE()) || \
		((address + numValues - 1) >= HR_GET_DYNAMIC_SIZE()) )
	{
		return;
	}

	if( (address + numValues) > (HR_LAST_ELEMENT + 1) )
	{
		zprintf(CRITICAL_IMPORTANCE,"Server requested out of range register %d %d\r\n",address,numValues);
		numValues = HR_LAST_ELEMENT + 1 - address;
	}

    for( i = 0; i < numValues; i++ )
    {
       if( hubRegisterBank[address].read_handler_function != NULL )
       {
          hubRegisterBank[address].value = hubRegisterBank[address].read_handler_function(address);
          hubRegisterBank[address].updateWebFlag = true;
       }
       address++;
    }
    return;
}

/**************************************************************
 * Function Name   : HubReg_Refresh_All
 * Description     : Sets the update flags so the register map is sent to the server
 **************************************************************/
void HubReg_Refresh_All(void)
{
	HubReg_GetValues(0, HR_GET_DYNAMIC_SIZE());
}

/**************************************************************
 * Function Name   : HubReg_Dump
 * Description     : debug utility
 **************************************************************/
void hub_reg_dump(char* s, HUB_REGISTER_TYPE reg, uint32_t num_regs)
{
	uint32_t i;
	zprintf(CRITICAL_IMPORTANCE, "\t[ 0x%02x | %-31s| 0x%02x", reg, s, hubRegisterBank[reg].read_handler_function(reg));
	for( i = 1; i < num_regs; i++ )
	{
		zprintf(CRITICAL_IMPORTANCE, "%02x", hubRegisterBank[reg+i].read_handler_function(reg+i));
	}
	zprintf(CRITICAL_IMPORTANCE, "%*s| ", 10-2*num_regs, "");
	for( i = 0; i < num_regs; i++ )
	{
		if( true == hubRegisterBank[reg+i].updateWebFlag )
		{
			zprintf(CRITICAL_IMPORTANCE, "+");
		} else
		{
			zprintf(CRITICAL_IMPORTANCE, "-");
		}
	}
	zprintf(CRITICAL_IMPORTANCE, "%*s]\r\n", 7-num_regs, "");
	DbgConsole_Flush();
}

void HubReg_Dump(void)
{
    uint32_t i,j;
	char mapHeader[] = "\t[--Reg-|------------- Name -------------|----Value----| +-Flag ]\r\n";
	int32_t	table_width = strlen(mapHeader)-3;

    zprintf(CRITICAL_IMPORTANCE, mapHeader);

    hub_reg_dump("DEVICE_TYPE",			HR_DEVICE_TYPE, 1);
    hub_reg_dump("NUM_REGISTERS",		HR_NUM_REGISTERS_LOW, 2);
    hub_reg_dump("FIRMWARE_MAJOR",		HR_HUB_FIRMWARE_MAJOR_LOW, 2);
    hub_reg_dump("FIRMWARE_MINOR",		HR_HUB_FIRMWARE_MINOR_LOW, 2);
    hub_reg_dump("HARDWARE_MAJOR",		HR_HUB_HARDWARE_MAJOR_LOW, 2);
    hub_reg_dump("BOOTLOADER_MAJOR",	HR_HUB_BOOTLOADER_MAJOR, 2);
    hub_reg_dump("MAX_MESSAGE_SIZE",	HR_HUB_MAX_MESSAGE_SIZE_LOW, 2);
    hub_reg_dump("FIRMWARE_CHECKSUM",	HR_HUB_FIRMWARE_CHECKSUM_LOW, 2);
    hub_reg_dump("PAIRING_STATE",		HR_PAIRING_STATE, 1);
    hub_reg_dump("DEBUG_MODE",			HR_DEBUG_MODE, 1);
    hub_reg_dump("PAIRING_TIMER",		HR_PAIRING_TIMER_VALUE, 1);
    hub_reg_dump("LEDS_MODE",			HR_LEDS_MODE, 1);
    hub_reg_dump("REMOTE_REBOOT",		HR_REMOTE_REBOOT, 1);
    hub_reg_dump("CLEAR_PAIRING_TABLE",	HR_CLEAR_PAIRING_TABLE, 1);
    hub_reg_dump("INITIATE_CHANNEL_HOP",HR_INITIATE_CHANNEL_HOP, 1);
    hub_reg_dump("DELETE_CONNECTION_TABLE_ENTRY",HR_DELETE_CONNECTION_TABLE_ENTRY, 1);
    hub_reg_dump("CHANNEL_NOISE_FLOOR",	HR_SURENET_CHANNEL_NOISE_FLOOR, 1);
    hub_reg_dump("CHANNEL_NUMBER",		HR_SURENET_CHANNEL_NUMBER, 1);
    hub_reg_dump("APPLICATION_ERROR",	HR_APPLICATION_ERROR_LOW, 2);
    hub_reg_dump("HUB_UPTIME",			HR_HUB_UPTIME_LOW, 4);
    hub_reg_dump("BANK_A_MARK",			HR_HUB_BANK_A_MARK, 1);
    hub_reg_dump("BANK_A_WATCHDOG_RESETS",	HR_HUB_BANK_A_WDOG_RESETS, 1);
    hub_reg_dump("BANK_B_MARK",			HR_HUB_BANK_B_MARK, 1);
    hub_reg_dump("BANK_B_WATCHDOG_RESETS",	HR_HUB_BANK_B_WDOG_RESETS, 1);
    hub_reg_dump("BANK_A_HASH",			HR_HUB_BANK_A_HASH_LOW, 4);
    hub_reg_dump("BANK_B_HASH",			HR_HUB_BANK_B_HASH_LOW, 4);
    hub_reg_dump("DEVICE_TABLE_SIZE",	HR_DEVICE_TABLE_SIZE, 1);
    hub_reg_dump("NUMBER_CONNECTIONS",	HR_DEVICE_TABLE_NUMBER_CONNECTIONS, 1);

	zprintf(CRITICAL_IMPORTANCE, "\t[--- End Hub Register Map ---]\r\n");

	zprintf(CRITICAL_IMPORTANCE, "\t[--- Device Table |%*s]\r\n", table_width - 20, "| " xstrfy(MAX_NUMBER_OF_DEVICES) " Entries ");
    for( i = 0; i < MAX_NUMBER_OF_DEVICES; i++ )
    {
		zprintf(CRITICAL_IMPORTANCE, "\t[ Device #%02d | ", i);
        for( j = 0; j < sizeof(DEVICE_STATUS); j++ )
        {
            zprintf(CRITICAL_IMPORTANCE, "%02X ",hubRegisterBank[HR_DEVICE_TABLE + (i * sizeof(DEVICE_STATUS)) + j].value);
        }
        zprintf(CRITICAL_IMPORTANCE, "]\r\n");
		DbgConsole_Flush();
    }
	zprintf(CRITICAL_IMPORTANCE, "\t[--- End Device Table ---]\r\n");
}

uint8_t HRM_Read_Image_Hash(uint16_t address)
{
	char					result[WC_SHA256_DIGEST_SIZE];
	uint16_t				base_address;
	int						i, j;
	wc_Sha256				hash_context;
	const BANK_DESCRIPTOR*	descriptor = NULL;

	if( address == HR_HUB_BANK_B_HASH_LOW )
	{
		base_address = HR_HUB_BANK_B_HASH_LOW;
		descriptor = &BankB_Descriptor;
	} else if( address == HR_HUB_BANK_A_HASH_LOW )
	{
		base_address = HR_HUB_BANK_A_HASH_LOW;
		descriptor = &BankA_Descriptor;
	}

	if( NULL == descriptor ){ return hubRegisterBank[address].value; }

	wc_InitSha256(&hash_context);
	wc_Sha256Update(&hash_context, (const byte*)descriptor->vector_table_offset, descriptor->image_size);
	wc_Sha256Final(&hash_context, (byte*)result);

	for( i = 0; i < 4; i++ )
	{
		hubRegisterBank[base_address + i].value = 0;
		hubRegisterBank[base_address + i].updateWebFlag = true;
		for( j = i; j < WC_SHA256_DIGEST_SIZE; j += 4 )
		{
			hubRegisterBank[base_address + i].value ^= result[j];
		}
	}

	return hubRegisterBank[address].value;
}

uint32_t HubReg_Get_Integer(uint16_t address)
{
	uint32_t ret = hubRegisterBank[address].value;
	ret |= (uint32_t)hubRegisterBank[address + 1].value << 8;
	ret |= (uint32_t)hubRegisterBank[address + 2].value << 16;
	ret |= (uint32_t)hubRegisterBank[address + 3].value << 24;

	return ret;
}